app/controllers/assignment_specialty_disciplines_controller.rb

SELECT "assignment_specialty_disciplines".* FROM "assignment_specialty_disciplines"
---
  def index
    @assignment_specialty_disciplines = AssignmentSpecialtyDiscipline.all