app/controllers/disciplines_controller.rb

SELECT "disciplines".* FROM "disciplines"
---
  def index
    @disciplines = Discipline.all

INSERT INTO "disciplines" ("name", "module", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "physics"], ["module", 1], ["created_at", 2016-11-07 16:03:05 UTC], ["updated_at", 2016-11-07 16:03:05 UTC]]
---
  def create
    @discipline = Discipline.new(discipline_params)

    respond_to do |format|
      if @discipline.save

SELECT  "disciplines".* FROM "disciplines" WHERE "disciplines"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_discipline
      @discipline = Discipline.find(params[:id])