app/controllers/link_specialty_disciplines_controller.rb

  def index
    @link_specialty_disciplines = LinkSpecialtyDiscipline.all
---
SELECT "link_specialty_disciplines".* FROM "link_specialty_disciplines"

    def set_link_specialty_discipline
      @link_specialty_discipline = LinkSpecialtyDiscipline.find(params[:id])
---
SELECT  "disciplines".* FROM "disciplines" WHERE "disciplines"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]