app/controllers/specialties_controller.rb

SELECT "specialties".* FROM "specialties" WHERE (full_direction ilike '%Информатика%') AND (level = '1')
---
  def index
      @specialties = Specialty.all

SELECT  "specialties".* FROM "specialties" WHERE "specialties"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_specialty
      @specialty = Specialty.find(params[:id])